FemDesign.Results.BarInternalForce
FemDesign "Bars, Internal Force" result

FemDesign.Results.BarInternalForce.Id
Bar name identifier

FemDesign.Results.BarInternalForce.Pos
Position Result
The value is the relative distance from the
starting point of the bar

FemDesign.Results.BarInternalForce.Fx
Axial force

FemDesign.Results.BarInternalForce.Fy
Shear force along major axis

FemDesign.Results.BarInternalForce.Fz
Shear force along minor axis

FemDesign.Results.BarInternalForce.Mx
Moment around axis

FemDesign.Results.BarInternalForce.My
Moment around major bending axis

FemDesign.Results.BarInternalForce.Mz
Moment around minor bending axis

FemDesign.Results.BarInternalForce.CaseIdentifier
Load case or combination name

FemDesign.Results.BarInternalForce.DeconstructBarInternalForce(System.Collections.Generic.List{FemDesign.Results.BarInternalForce},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.